Repository: DB4SCW/wavelog
Catalog: install/includes/gettext/locale/*/LC_MESSAGES/installer.po
Languages: fi_fi

source: not detected
fi_fi: ei tunnistettu

source: Albanian
fi_fi: albanialainen

source: Armenian
fi_fi: armenialainen

source: Bosnian
fi_fi: bosnialainen

source: Bulgarian
fi_fi: bulgarialainen

source: Chinese (Simplified)
fi_fi: Kiina (yksinkertaistettu)

source: Croatian
fi_fi: kroatialainen

source: Czech
fi_fi: tšekkiläinen

source: Dutch
fi_fi: hollantilainen

source: English
fi_fi: englanti

source: Estonian
fi_fi: virolainen

source: Finnish
fi_fi: suomi

source: French
fi_fi: ranskalainen

source: German
fi_fi: saksalainen

source: Greek
fi_fi: kreikka

source: Hungarian
fi_fi: unkarilainen

source: Italian
fi_fi: italialainen

source: Japanese
fi_fi: japanilainen

source: Latvian
fi_fi: latvialainen

source: Lithuanian
fi_fi: liettualainen

source: Montenegrin
fi_fi: montenegrolainen

source: Polish
fi_fi: puolalainen

source: Portuguese
fi_fi: portugalilainen

source: Russian
fi_fi: venäläinen

source: Serbian
fi_fi: serbialainen

source: Slovak
fi_fi: slovakialainen

source: Slovenian
fi_fi: slovenialainen

source: Spanish
fi_fi: espanjalainen

source: Swedish
fi_fi: ruotsalainen

source: Turkish
fi_fi: turkkilainen

source: Install | Wavelog
fi_fi: Asenna | Wavelog

source: 1. Welcome
fi_fi: 1. Tervetuloa

source: 2. Pre Checks
fi_fi: 2. Esitarkitukset

source: 3. Configuration
fi_fi: 3. Konfiguraatio

source: 4. Database
fi_fi: 4. Tietokanta

source: 5. First User
fi_fi: 5. Ensimmäinen käyttäjä

source: 6. Finish
fi_fi: 6. Loppu

source: Welcome to the Wavelog Installer
fi_fi: Tervetuloa Wavelogin asennukseen

source: This installer will guide you through the necessary steps for the installation of Wavelog. <br>Wavelog is a powerful web-based amateur radio logging software. Follow the steps in each tab to configure and install Wavelog on your server.
fi_fi: Tämä asennusohjelma opastaa sinut Wavelogin asentamiseen tarvittavien vaiheiden läpi.<br>Wavelog on tehokas selainpohjainen radioamatöörien lokiohjelmisto. Seuraa kunkin välilehden ohjeita määrittääksesi ja asentaaksesi Wavelogin palvelimellesi.

source: Discussions
fi_fi: Keskustelut

source: If you encounter any issues or have questions, refer to the documentation (%s) or community forum (%s) on Github for assistance.
fi_fi: Jos kohtaat ongelmia tai sinulla on kysyttävää, katso ohjeista (%s) tai GitHubin foorumilta (%s) apua.

source: Thank you for installing Wavelog!
fi_fi: Kiitos Wavelogin asentamisesta!

source: Language
fi_fi: Kieli

source: Select a language
fi_fi: Valitse kieli

source: Close
fi_fi: Sulje

source: PHP Modules
fi_fi: PHP moduulit

source: Version
fi_fi: Versio

# PHP Version
source: min. %s (recommended %s+)
fi_fi: min. %s (suositeltu %s+)

source: Installed
fi_fi: Asennettu

source: Not Installed
fi_fi: Ei asennettu

source: PHP Settings
fi_fi: PHP asetukset

source: Web Server
fi_fi: Web palvelin

source: Version:
fi_fi: Versio:

source: Important note for nginx users!
fi_fi: Tärketä tiedote nginx-käyttäjille!

source: Since you are using nginx as web server please make sure that you have made the changes described in the Wiki before continuing.
fi_fi: Koska käytät nginxiä verkkopalvelimena, varmista ennen jatkamista, että olet tehnyt Wikissä kuvatut muutokset.

source: Folder Write Permissions
fi_fi: Kansion kirjoitusoikeudet

source: Success
fi_fi: Onnistui

source: Failed
fi_fi: Epäonnistui

source: Some Checks have failed!
fi_fi: Osa tarkistuksista epäonnistui!

source: Check your PHP settings and install missing modules if necessary.
fi_fi: Tarkista PHP-asetuksesi ja asenna tarvittaessa puuttuvat moduulit.

source: After that, you have to restart your webserver and start the installer again.
fi_fi: Tämän jälkeen sinun täytyy käynnistää verkkopalvelimesi uudelleen ja käynnistää asennusohjelma uudestaan.

source: In case of failed 'Folder Write Permissions' check out our Wiki <a href='%s' target='_blank'>here</a>.
fi_fi: Jos 'Kansion kirjoitusoikeudet' -tarkistus epäonnistuu, katso ohjeet Wikistämme <a href='%s' target='_blank'>täältä</a>.

source: You have some warnings!
fi_fi: Sinulle on varoituksia!

source: Some of the settings are not optimal. You can proceed with the installer but be aware that you could run into problems while using Wavelog.
fi_fi: Jotkin asetuksista eivät ole optimaalisia. Voit jatkaa asennusohjelmaa, mutta huomioi, että Wavelogin käytön aikana voi ilmetä ongelmia.

source: All Checks are OK. You can continue.
fi_fi: Kaikki tarkistukset ovat kunnossa. Voit jatkaa.

source: Configure some basic parameters for your wavelog instance. You can change them later in 'application/config/config.php'
fi_fi: Määritä Wavelog-instanssisi perusasetukset. Voit muuttaa niitä myöhemmin tiedostossa 'application/config/config.php'

source: This is the URL where you can access this Wavelog instance after the installer has run. If this does not display what you expect, you may need to check your web server configuration. This is the base_url in your config.php, which can be edited after the installation.
fi_fi: Tämä on URL-osoite, josta pääset tähän Wavelog-instanssiin asennusohjelman suorituksen jälkeen. Jos näkymä ei ole odotettu, sinun kannattaa tarkistaa verkkopalvelimesi asetukset. Tämä osoite vastaa config.php-tiedoston base_url-asetusta, jota voi muokata asennuksen jälkeen.

source: Your final Wavelog URL
fi_fi: Wavelogin lopullinen URL-osoite

source: Optional: Global Callbook Lookup
fi_fi: Valinnainen: globaali Callbook-haku

source: This configuration is optional. The callsign lookup will be available for all users of this installation. You can choose between QRZ.com and HamQTH. While HamQTH also works without username and password, you will need credentials for QRZ.com. To also get the Call Locator in QRZ.com you'll need an XML subscription. HamQTH does not always provide the locator information.
fi_fi: Tämä määritys on valinnainen. Kutsumerkkihaku on käytettävissä kaikille tämän asennuksen käyttäjille. Voit valita palveluksi QRZ.com tai HamQTH. HamQTH toimii myös ilman käyttäjätunnusta ja salasanaa, mutta QRZ.comin käyttö edellyttää kirjautumistietoja. Jotta saat QRZ.comista myös kutsumerkin lokaattoritiedon, tarvitset XML-tilauksen. HamQTH ei aina tarjoa lokaattoritietoa.

source: Username
fi_fi: Käyttäjänimi

source: Password
fi_fi: Salasana

source: Callbook Username
fi_fi: Callbook:n käyttäjänimi

source: Callbook Password
fi_fi: Callbook:n salasana

source: Password can't contain %s or be empty
fi_fi: Salasana ei saa sisältää merkkiä %s eikä se saa olla tyhjä

source: Good to know:
fi_fi: Hyvä tietää:

source: Use your callsign as your username for QRZ.com. The XML API does not support email addresses.
fi_fi: Käytä kutsumerkkiasi käyttäjätunnuksena QRZ.comissa. XML-rajapinta ei tue sähköpostiosoitteita.

source: Advanced Settings
fi_fi: Lisäasetukset

source: These settings should only be set if you know what you're doing.
fi_fi: Näitä asetuksia tulisi muuttaa vain, jos tiedät mitä olet tekemässä.

source: Error Logs
fi_fi: Virhelogit

source: Optional: Enable Error Logging by setting the log threshold bigger then 0. Only enable this if you really need it.
fi_fi: Valinnainen: ota virhelokin kirjaus käyttöön asettamalla lokikynnysarvo suuremmaksi kuin 0. Ota tämä käyttöön vain, jos todella tarvitset sitä.

source: 0 - No logs
fi_fi: 0 - ei lokia

source: 1 - Error messages
fi_fi: 1 – Virheilmoitukset

source: 2 - Debug messages
fi_fi: 2 – Virheenkorjausviestit

source: 3 - Info messages
fi_fi: 3 – Infoviestit

source: 4 - All messages
fi_fi: 4 – Kaikki viestit

source: To properly install Wavelog you already should have setup a mariadb/mysql database. Provide the parameters here.
fi_fi: Jotta Wavelog voidaan asentaa oikein, sinun tulee olla jo luonut MariaDB- tai MySQL-tietokanta. Anna sen tiedot tähän.

source: Hostname or IP
fi_fi: Palvelimen nimi tai IP-osoite

source: Usually 'localhost'.<br>Optional with '[host]:[port]'. Default port: 3306.<br>In a docker compose install type 'wavelog-db'.
fi_fi: Yleensä ”localhost”.<br>Valinnaisesti muodossa [isäntä]:[portti]. Oletusportti: 3306.<br>Docker Compose -asennuksessa kirjoita ”wavelog-db”.

source: Database Name
fi_fi: Tietokannan nimi

source: Name of the Database
fi_fi: Tietokannan nimi

source: Username of the Database User which has full access to the database.
fi_fi: Tietokantakäyttäjän käyttäjätunnus, jolla on täydet oikeudet tietokantaan.

source: Password of the Database User
fi_fi: Tietokantakäyttäjän salasana

source: Connection Test
fi_fi: Yhteystesti

source: Now you can create your first user in Wavelog. Fill out all fields and click continue. Make sure you use a safe password.
fi_fi: Nyt voit luoda ensimmäisen käyttäjän Wavelogiin. Täytä kaikki kentät ja napsauta Jatka. Varmista, että käytät turvallista salasanaa.

source: All fields are required!
fi_fi: Kaikki kentät ovat pakollisia!

source: First Name
fi_fi: Etunimi

source: Please select one
fi_fi: Valitse yksi

source: Deleted DXCC
fi_fi: Poistettu DXCC

source: Last Name
fi_fi: Sukunimi

source: Callsign
fi_fi: Radioamatöörikutsu

source: Gridsquare/Locator
fi_fi: Ruutu/lokaattori

source: City
fi_fi: Kaupunki

source: Confirm Password
fi_fi: Vahvista salasana

source: Timezone
fi_fi: Aikavyöhyke

source: E-Mail Address
fi_fi: Sähköpostiosoite

source: Checklist
fi_fi: Tarkistuslista

source: Pre-Checks
fi_fi: Esitarkistukset

source: Configuration
fi_fi: Konfiguraatio

source: Database
fi_fi: Tietokanta

source: First User
fi_fi: Ensimmäinen käyttäjä

source: Nearly done!
fi_fi: Melkein valmista!

source: You prepared all neccessary steps.
fi_fi: Olet suorittanut kaikki tarvittavat vaiheet.

source: We now can install Wavelog. This process can take a few minutes.
fi_fi: Wavelog voidaan nyt asentaa. Tämä prosessi voi kestää muutaman minuutin.

source: Reset
fi_fi: Palauta

source: Installer Reset
fi_fi: Asennusohjelman palautus

source: Do you really want to reset all data and start from scratch?
fi_fi: Haluatko varmasti nollata kaikki tiedot ja aloittaa alusta?

source: Yes
fi_fi: Kyllä

source: No
fi_fi: Ei

source: Back
fi_fi: Takaisin

source: Continue
fi_fi: Jatka

source: You can't continue. Solve the red marked issues, restart the webserver and reload this page.
fi_fi: Et voi jatkaa. Korjaa punaisella merkityt ongelmat, käynnistä verkkopalvelin uudelleen ja lataa tämä sivu uudelleen.

source: Password can't contain ' / \ < >
fi_fi: Salasana ei saa sisältää merkkejä ' / \ < >

source: The callsign should not contain any pre- or suffixes as it is used as personal operator callsign.
fi_fi: Kutsumerkki ei saa sisältää etu- eikä jälkiliitteitä, koska sitä käytetään henkilökohtaisena operaattorin kutsumerkkinä.

source: The callsign can not contain any special characters. It's your personal callsign without any pre- or suffixes.
fi_fi: Kutsumerkki ei saa sisältää erikoismerkkejä. Sen tulee olla henkilökohtainen kutsumerkkisi ilman etu- tai jälkiliitteitä.

source: Error: At least Hostname/IP, Database Name and Username are required.
fi_fi: Virhe: Vähintään palvelimen nimi/IP-osoite, tietokannan nimi ja käyttäjätunnus ovat pakollisia.

source: Connecting...
fi_fi: Yhdistää...

source: Connection was successful and your database should be compatible.
fi_fi: Yhteys onnistui ja tietokantasi vaikuttaa olevan yhteensopiva.

source: Connection was successful but your database seems too old for Wavelog. You can try to continue but you could run into issues.
fi_fi: Yhteys onnistui, mutta tietokantasi vaikuttaa olevan liian vanha Wavelogia varten. Voit yrittää jatkaa, mutta saatat kohdata ongelmia.

source: The min. version for MySQL is %s, for MariaDB it's %s.
fi_fi: MySQL:n vähimmäisversio on %s ja MariaDB:n %s.

source: Search
fi_fi: Etsi

source: At least one field is empty.
fi_fi: Ainakin yksi kenttä on tyhjä.

source: Stop here for a Moment. Your chosen DXCC is outdated and not valid anymore. Check which DXCC for this particular location is the correct one. If you are sure, ignore this warning.
fi_fi: Pysähdy tähän hetkeksi. Valitsemasi DXCC on vanhentunut eikä ole enää voimassa. Tarkista, mikä DXCC on oikea tälle sijainnille. Jos olet varma valinnastasi, voit sivuuttaa tämän varoituksen.

source: The locator seems to be not in the correct format. Should look like AA11AA (6-char grid locator).
fi_fi: Lokaattori ei näytä olevan oikeassa muodossa. Sen pitäisi olla muotoa AA11AA (6-merkkinen grid-lokaattori).

source: The e-mail adress does not look correct. Make sure it's a valid e-mail address
fi_fi: Sähköpostiosoite ei näytä oikealta. Varmista, että se on kelvollinen sähköpostiosoite

source: Password should be at least 8 characters long
fi_fi: Salasanan tulee olla vähintään 8 merkkiä pitkä

source: Passwords do not match
fi_fi: Salasanat eivät täsmää

source: Install Now
fi_fi: Asenna nyt

source: Install not possible. Checklist incomplete.
fi_fi: Asennus ei ole mahdollinen. Tarkistuslista on keskeneräinen.

source: PHP Module missing
fi_fi: PHP-moduuli puuttuu

source: The following PHP modules are missing:
fi_fi: Seuraavat PHP-moduulit puuttuvat:

source: Without this module the Wavelog Installer does not work!
fi_fi: Ilman tätä moduulia Wavelogin asennusohjelma ei toimi!

source: Please install the required modules and restart the webserver.
fi_fi: Asenna vaaditut moduulit ja käynnistä verkkopalvelin uudelleen.

source: Installation
fi_fi: Asennus

source: Please wait...
fi_fi: Ole hyvä ja odota...

source: Copy config.php to application/config/
fi_fi: Kopioi config.php hakemistoon application/config/

source: Copy database.php to application/config/
fi_fi: Kopioi database.php hakemistoon application/config/

source: Creating database tables
fi_fi: Tietokantataulujen luominen

source: Running database migrations
fi_fi: Tietokantamigraatioiden suorittaminen

source: Updating DXCC data
fi_fi: DXCC-tietojen päivittäminen

source: Lock the installer
fi_fi: Lukitse asennusohjelma

source: All install steps went through. Redirect to user login in %s seconds...
fi_fi: Kaikki asennusvaiheet suoritettiin onnistuneesti. Uudelleenohjataan käyttäjien kirjautumissivulle %s sekunnin kuluttua…

source: Done. Go to the user login ->
fi_fi: Valmis. Siirry käyttäjien kirjautumissivulle →

source: Show detailled debug log
fi_fi: Näytä yksityiskohtainen virheenkorjausloki

source: Hide detailled debug log
fi_fi: Piilota yksityiskohtainen virheenkorjausloki

source: Could not create application/config/config.php
fi_fi: Tiedostoa application/config/config.php ei voitu luoda

source: Could not create application/config/database.php
fi_fi: Tiedostoa application/config/database.php ei voitu luoda

source: Could not create database tables
fi_fi: Tietokantatauluja ei voitu luoda

source: Could not run database migrations
fi_fi: Tietokantamigraatioita ei voitu suorittaa

source: Could not update DXCC data
fi_fi: DXCC-tietoja ei voitu päivittää

source: Could not create install/.lock file
fi_fi: Tiedostoa install/.lock ei voitu luoda
